espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/lp_i2s_struct.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: VAD registers */
/** Type of vad_conf register
 *  I2S VAD Configure register
 */
typedef union {
    struct {
        /** vad_en : R/W; bitpos: [0]; default: 0;
         *  VAD enable register
         */
        uint32_t vad_en:1;
        /** vad_reset : WT; bitpos: [1]; default: 0;
         *  VAD reset register
         */
        uint32_t vad_reset:1;
        /** vad_force_start : WT; bitpos: [2]; default: 0;
         *  VAD force start register.
         */
        uint32_t vad_force_start:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} lp_i2s_vad_conf_reg_t;

/** Type of vad_result register
 *  I2S VAD Result register
 */
typedef union {
    struct {
        /** vad_flag : RO; bitpos: [0]; default: 0;
         *  Reg vad flag observe signal
         */
        uint32_t vad_flag:1;
        /** energy_enough : RO; bitpos: [1]; default: 0;
         *  Reg energy enough observe signal
         */
        uint32_t energy_enough:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} lp_i2s_vad_result_reg_t;

/** Type of vad_param0 register
 *  I2S VAD Parameter register
 */
typedef union {
    struct {
        /** param_min_energy : R/W; bitpos: [15:0]; default: 5000;
         *  VAD parameter
         */
        uint32_t param_min_energy:16;
        /** param_init_frame_num : R/W; bitpos: [24:16]; default: 200;
         *  VAD parameter
         */
        uint32_t param_init_frame_num:9;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} lp_i2s_vad_param0_reg_t;

/** Type of vad_param1 register
 *  I2S VAD Parameter register
 */
typedef union {
    struct {
        /** param_min_speech_count : R/W; bitpos: [3:0]; default: 3;
         *  VAD parameter
         */
        uint32_t param_min_speech_count:4;
        /** param_max_speech_count : R/W; bitpos: [10:4]; default: 100;
         *  VAD parameter
         */
        uint32_t param_max_speech_count:7;
        /** param_hangover_speech : R/W; bitpos: [15:11]; default: 3;
         *  VAD parameter
         */
        uint32_t param_hangover_speech:5;
        /** param_hangover_silent : R/W; bitpos: [23:16]; default: 30;
         *  VAD parameter
         */
        uint32_t param_hangover_silent:8;
        /** param_max_offset : R/W; bitpos: [30:24]; default: 40;
         *  VAD parameter
         */
        uint32_t param_max_offset:7;
        /** param_skip_band_energy : R/W; bitpos: [31]; default: 0;
         *  Set 1 to skip band energy check.
         */
        uint32_t param_skip_band_energy:1;
    };
    uint32_t val;
} lp_i2s_vad_param1_reg_t;

/** Type of vad_param2 register
 *  I2S VAD Parameter register
 */
typedef union {
    struct {
        /** param_noise_amp_down : R/W; bitpos: [15:0]; default: 26214;
         *  VAD parameter
         */
        uint32_t param_noise_amp_down:16;
        /** param_noise_amp_up : R/W; bitpos: [31:16]; default: 32440;
         *  VAD parameter
         */
        uint32_t param_noise_amp_up:16;
    };
    uint32_t val;
} lp_i2s_vad_param2_reg_t;

/** Type of vad_param3 register
 *  I2S VAD Parameter register
 */
typedef union {
    struct {
        /** param_noise_spe_up0 : R/W; bitpos: [15:0]; default: 32735;
         *  VAD parameter
         */
        uint32_t param_noise_spe_up0:16;
        /** param_noise_spe_up1 : R/W; bitpos: [31:16]; default: 32113;
         *  VAD parameter
         */
        uint32_t param_noise_spe_up1:16;
    };
    uint32_t val;
} lp_i2s_vad_param3_reg_t;

/** Type of vad_param4 register
 *  I2S VAD Parameter register
 */
typedef union {
    struct {
        /** param_noise_spe_down : R/W; bitpos: [15:0]; default: 26214;
         *  VAD parameter
         */
        uint32_t param_noise_spe_down:16;
        /** param_noise_mean_down : R/W; bitpos: [31:16]; default: 31130;
         *  VAD parameter
         */
        uint32_t param_noise_mean_down:16;
    };
    uint32_t val;
} lp_i2s_vad_param4_reg_t;

/** Type of vad_param5 register
 *  I2S VAD Parameter register
 */
typedef union {
    struct {
        /** param_noise_mean_up0 : R/W; bitpos: [15:0]; default: 32113;
         *  VAD parameter
         */
        uint32_t param_noise_mean_up0:16;
        /** param_noise_mean_up1 : R/W; bitpos: [31:16]; default: 31784;
         *  VAD parameter
         */
        uint32_t param_noise_mean_up1:16;
    };
    uint32_t val;
} lp_i2s_vad_param5_reg_t;

/** Type of vad_param6 register
 *  I2S VAD Parameter register
 */
typedef union {
    struct {
        /** param_noise_std_fs_thsl : R/W; bitpos: [15:0]; default: 32000;
         *  Feature_sum threshold to determine noise_std max value when vad_tag=1, equal to
         *  ((noise_std_max)>>11)^2*5
         */
        uint32_t param_noise_std_fs_thsl:16;
        /** param_noise_std_fs_thsh : R/W; bitpos: [31:16]; default: 46080;
         *  Feature_sum threshold to determine noise_std max value when vad_tag=0, equal to
         *  ((noise_std_max)>>11)^2*5
         */
        uint32_t param_noise_std_fs_thsh:16;
    };
    uint32_t val;
} lp_i2s_vad_param6_reg_t;

/** Type of vad_param7 register
 *  I2S VAD Parameter register
 */
typedef union {
    struct {
        /** param_thres_upd_base : R/W; bitpos: [15:0]; default: 32440;
         *  VAD parameter
         */
        uint32_t param_thres_upd_base:16;
        /** param_thres_upd_vary : R/W; bitpos: [31:16]; default: 328;
         *  VAD parameter
         */
        uint32_t param_thres_upd_vary:16;
    };
    uint32_t val;
} lp_i2s_vad_param7_reg_t;

/** Type of vad_param8 register
 *  I2S VAD Parameter register
 */
typedef union {
    struct {
        /** param_thres_upd_bdl : R/W; bitpos: [7:0]; default: 64;
         *  Noise_std boundary low when updating threshold.
         */
        uint32_t param_thres_upd_bdl:8;
        /** param_thres_upd_bdh : R/W; bitpos: [15:8]; default: 80;
         *  Noise_std boundary high when updating threshold.
         */
        uint32_t param_thres_upd_bdh:8;
        /** param_feature_burst : R/W; bitpos: [31:16]; default: 8192;
         *  VAD parameter
         */
        uint32_t param_feature_burst:16;
    };
    uint32_t val;
} lp_i2s_vad_param8_reg_t;

/** Type of vad_ob0 register
 *  I2S VAD Observe register
 */
typedef union {
    struct {
        /** speech_count_ob : RO; bitpos: [7:0]; default: 0;
         *  Reg silent count observe
         */
        uint32_t speech_count_ob:8;
        /** silent_count_ob : RO; bitpos: [15:8]; default: 0;
         *  Reg speech count observe
         */
        uint32_t silent_count_ob:8;
        /** max_signal0_ob : RO; bitpos: [31:16]; default: 0;
         *  Reg max signal0 observe
         */
        uint32_t max_signal0_ob:16;
    };
    uint32_t val;
} lp_i2s_vad_ob0_reg_t;

