espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/lp_i2s_struct.h
/** Type of vad_ob1 register
 *  I2S VAD Observe register
 */
typedef union {
    struct {
        /** max_signal1_ob : RO; bitpos: [15:0]; default: 0;
         *  Reg max signal1 observe
         */
        uint32_t max_signal1_ob:16;
        /** max_signal2_ob : RO; bitpos: [31:16]; default: 0;
         *  Reg max signal2 observe
         */
        uint32_t max_signal2_ob:16;
    };
    uint32_t val;
} lp_i2s_vad_ob1_reg_t;

/** Type of vad_ob2 register
 *  I2S VAD Observe register
 */
typedef union {
    struct {
        /** noise_amp_ob : RO; bitpos: [31:0]; default: 0;
         *  Reg noise_amp observe signal
         */
        uint32_t noise_amp_ob:32;
    };
    uint32_t val;
} lp_i2s_vad_ob2_reg_t;

/** Type of vad_ob3 register
 *  I2S VAD Observe register
 */
typedef union {
    struct {
        /** noise_mean_ob : RO; bitpos: [31:0]; default: 0;
         *  Reg noise_mean observe signal
         */
        uint32_t noise_mean_ob:32;
    };
    uint32_t val;
} lp_i2s_vad_ob3_reg_t;

/** Type of vad_ob4 register
 *  I2S VAD Observe register
 */
typedef union {
    struct {
        /** noise_std_ob : RO; bitpos: [31:0]; default: 0;
         *  Reg noise_std observe signal
         */
        uint32_t noise_std_ob:32;
    };
    uint32_t val;
} lp_i2s_vad_ob4_reg_t;

/** Type of vad_ob5 register
 *  I2S VAD Observe register
 */
typedef union {
    struct {
        /** offset_ob : RO; bitpos: [31:0]; default: 0;
         *  Reg offset observe signal
         */
        uint32_t offset_ob:32;
    };
    uint32_t val;
} lp_i2s_vad_ob5_reg_t;

/** Type of vad_ob6 register
 *  I2S VAD Observe register
 */
typedef union {
    struct {
        /** threshold_ob : RO; bitpos: [31:0]; default: 0;
         *  Reg threshold observe signal
         */
        uint32_t threshold_ob:32;
    };
    uint32_t val;
} lp_i2s_vad_ob6_reg_t;

/** Type of vad_ob7 register
 *  I2S VAD Observe register
 */
typedef union {
    struct {
        /** energy_low_ob : RO; bitpos: [31:0]; default: 0;
         *  Reg energy bit 31~0 observe signal
         */
        uint32_t energy_low_ob:32;
    };
    uint32_t val;
} lp_i2s_vad_ob7_reg_t;

/** Type of vad_ob8 register
 *  I2S VAD Observe register
 */
typedef union {
    struct {
        /** energy_high_ob : RO; bitpos: [31:0]; default: 0;
         *  Reg energy bit 63~32 observe signal
         */
        uint32_t energy_high_ob:32;
    };
    uint32_t val;
} lp_i2s_vad_ob8_reg_t;


/** Group: RX Control and configuration registers */
/** Type of rx_mem_conf register
 *  I2S VAD Observe register
 */
typedef union {
    struct {
        /** rx_mem_fifo_cnt : RO; bitpos: [8:0]; default: 0;
         *  The number of data in the rx mem
         */
        uint32_t rx_mem_fifo_cnt:9;
        /** rx_mem_threshold : R/W; bitpos: [16:9]; default: 63;
         *  I2S rx mem will trigger an interrupt when the data in the mem is over(not including
         *  equal) reg_rx_mem_threshold
         */
        uint32_t rx_mem_threshold:8;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} lp_i2s_rx_mem_conf_reg_t;

/** Type of rx_conf register
 *  I2S RX configure register
 */
typedef union {
    struct {
        /** rx_reset : WT; bitpos: [0]; default: 0;
         *  Set this bit to reset receiver
         */
        uint32_t rx_reset:1;
        /** rx_fifo_reset : WT; bitpos: [1]; default: 0;
         *  Set this bit to reset Rx AFIFO
         */
        uint32_t rx_fifo_reset:1;
        /** rx_start : R/W; bitpos: [2]; default: 0;
         *  Set this bit to start receiving data
         */
        uint32_t rx_start:1;
        /** rx_slave_mod : R/W; bitpos: [3]; default: 0;
         *  Set this bit to enable slave receiver mode
         */
        uint32_t rx_slave_mod:1;
        /** rx_fifomem_reset : WT; bitpos: [4]; default: 0;
         *  Set this bit to reset Rx Syncfifomem
         */
        uint32_t rx_fifomem_reset:1;
        /** rx_mono : R/W; bitpos: [5]; default: 0;
         *  Set this bit to enable receiver  in mono mode
         */
        uint32_t rx_mono:1;
        uint32_t reserved_6:1;
        /** rx_big_endian : R/W; bitpos: [7]; default: 0;
         *  I2S Rx byte endian, 1: low addr value to high addr. 0: low addr with low addr value.
         */
        uint32_t rx_big_endian:1;
        /** rx_update : R/W/SC; bitpos: [8]; default: 0;
         *  Set 1 to update I2S RX registers from APB clock domain to I2S RX clock domain. This
         *  bit will be cleared by hardware after update register done.
         */
        uint32_t rx_update:1;
        /** rx_mono_fst_vld : R/W; bitpos: [9]; default: 1;
         *  1: The first channel data value is valid in I2S RX mono mode.   0: The second
         *  channel data value is valid in I2S RX mono mode.
         */
        uint32_t rx_mono_fst_vld:1;
        /** rx_pcm_conf : R/W; bitpos: [11:10]; default: 1;
         *  I2S RX compress/decompress configuration bit. & 0 (atol): A-Law decompress, 1
         *  (ltoa) : A-Law compress, 2 (utol) : u-Law decompress, 3 (ltou) : u-Law compress. &
         */
        uint32_t rx_pcm_conf:2;
        /** rx_pcm_bypass : R/W; bitpos: [12]; default: 1;
         *  Set this bit to bypass Compress/Decompress module for received data.
         */
        uint32_t rx_pcm_bypass:1;
        /** rx_stop_mode : R/W; bitpos: [14:13]; default: 0;
         *  0  : I2S Rx only stop when reg_rx_start is cleared.   1: Stop when reg_rx_start is
         *  0 or in_suc_eof is 1.   2:  Stop I2S RX when reg_rx_start is 0 or RX FIFO is full.
         */
        uint32_t rx_stop_mode:2;
        /** rx_left_align : R/W; bitpos: [15]; default: 1;
         *  1: I2S RX left alignment mode. 0: I2S RX right alignment mode.
         */
        uint32_t rx_left_align:1;
        /** rx_24_fill_en : R/W; bitpos: [16]; default: 0;
         *  1: store 24 channel bits to 32 bits. 0:store 24 channel bits to 24 bits.
         */
        uint32_t rx_24_fill_en:1;
        /** rx_ws_idle_pol : R/W; bitpos: [17]; default: 0;
         *  0: WS should be 0 when receiving left channel data, and WS is 1in right channel.
         *  1: WS should be 1 when receiving left channel data, and WS is 0in right channel.
         */
        uint32_t rx_ws_idle_pol:1;
        /** rx_bit_order : R/W; bitpos: [18]; default: 0;
         *  I2S Rx bit endian. 1:small endian, the LSB is received first. 0:big endian, the MSB
         *  is received first.
         */
        uint32_t rx_bit_order:1;
        /** rx_tdm_en : R/W; bitpos: [19]; default: 0;
         *  1: Enable I2S TDM Rx mode . 0: Disable.
         */
        uint32_t rx_tdm_en:1;
        /** rx_pdm_en : R/W; bitpos: [20]; default: 0;
         *  1: Enable I2S PDM Rx mode . 0: Disable.
         */
        uint32_t rx_pdm_en:1;
        uint32_t reserved_21:11;
    };
    uint32_t val;
} lp_i2s_rx_conf_reg_t;

/** Type of rx_conf1 register
 *  I2S RX configure register 1
 */
typedef union {
    struct {
        /** rx_tdm_ws_width : R/W; bitpos: [6:0]; default: 0;
         *  The width of rx_ws_out in TDM mode is (I2S_RX_TDM_WS_WIDTH[6:0] +1) * T_bck
         */
        uint32_t rx_tdm_ws_width:7;
        /** rx_bck_div_num : R/W; bitpos: [12:7]; default: 6;
         *  Bit clock configuration bits in receiver mode.
         */
        uint32_t rx_bck_div_num:6;
        /** rx_bits_mod : R/W; bitpos: [17:13]; default: 15;
         *  Set the bits to configure the valid data bit length of I2S receiver channel. 7: all
         *  the valid channel data is in 8-bit-mode. 15: all the valid channel data is in
         *  16-bit-mode. 23: all the valid channel data is in 24-bit-mode. 31:all the valid
         *  channel data is in 32-bit-mode.
         */
        uint32_t rx_bits_mod:5;
        /** rx_half_sample_bits : R/W; bitpos: [23:18]; default: 15;
         *  I2S Rx half sample bits -1.
         */
        uint32_t rx_half_sample_bits:6;
        /** rx_tdm_chan_bits : R/W; bitpos: [28:24]; default: 15;
         *  The Rx bit number for each channel minus 1in TDM mode.
         */
        uint32_t rx_tdm_chan_bits:5;
        /** rx_msb_shift : R/W; bitpos: [29]; default: 1;
         *  Set this bit to enable receiver in Phillips standard mode
         */
        uint32_t rx_msb_shift:1;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} lp_i2s_rx_conf1_reg_t;

