espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/lp_i2s_struct.h
/** Type of rx_tdm_ctrl register
 *  I2S TX TDM mode control register
 */
typedef union {
    struct {
        /** rx_tdm_pdm_chan0_en : R/W; bitpos: [0]; default: 1;
         *  1: Enable the valid data input of I2S RX TDM or PDM channel $n. 0:  Disable, just
         *  input 0 in this channel.
         */
        uint32_t rx_tdm_pdm_chan0_en:1;
        /** rx_tdm_pdm_chan1_en : R/W; bitpos: [1]; default: 1;
         *  1: Enable the valid data input of I2S RX TDM or PDM channel $n. 0:  Disable, just
         *  input 0 in this channel.
         */
        uint32_t rx_tdm_pdm_chan1_en:1;
        uint32_t reserved_2:14;
        /** rx_tdm_tot_chan_num : R/W; bitpos: [19:16]; default: 0;
         *  The total channel number of I2S TX TDM mode.
         */
        uint32_t rx_tdm_tot_chan_num:4;
        uint32_t reserved_20:12;
    };
    uint32_t val;
} lp_i2s_rx_tdm_ctrl_reg_t;

/** Type of rxeof_num register
 *  I2S RX data number control register.
 */
typedef union {
    struct {
        /** rx_eof_num : R/W; bitpos: [11:0]; default: 64;
         *  The receive data bit length is (I2S_RX_BITS_MOD[4:0] + 1) * (REG_RX_EOF_NUM[11:0] +
         *  1) . It will trigger in_suc_eof interrupt in the configured DMA RX channel.
         */
        uint32_t rx_eof_num:12;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} lp_i2s_rxeof_num_reg_t;

/** Type of rx_pdm_conf register
 *  I2S RX configure register
 */
typedef union {
    struct {
        uint32_t reserved_0:19;
        /** rx_pdm2pcm_en : R/W; bitpos: [19]; default: 0;
         *  1: Enable PDM2PCM RX mode. 0: DIsable.
         */
        uint32_t rx_pdm2pcm_en:1;
        /** rx_pdm_sinc_dsr_16_en : R/W; bitpos: [20]; default: 0;
         *  Configure the down sampling rate of PDM RX filter group1 module. 1: The  down
         *  sampling rate is 128. 0: down sampling rate is 64.
         */
        uint32_t rx_pdm_sinc_dsr_16_en:1;
        /** rx_pdm2pcm_amplify_num : R/W; bitpos: [24:21]; default: 1;
         *  Configure PDM RX amplify number.
         */
        uint32_t rx_pdm2pcm_amplify_num:4;
        /** rx_pdm_hp_bypass : R/W; bitpos: [25]; default: 0;
         *  I2S PDM RX bypass hp filter or not.
         */
        uint32_t rx_pdm_hp_bypass:1;
        /** rx_iir_hp_mult12_5 : R/W; bitpos: [28:26]; default: 6;
         *  The fourth parameter of PDM RX IIR_HP filter stage 2 is (504 +
         *  LP_I2S_RX_IIR_HP_MULT12_5[2:0])
         */
        uint32_t rx_iir_hp_mult12_5:3;
        /** rx_iir_hp_mult12_0 : R/W; bitpos: [31:29]; default: 7;
         *  The fourth parameter of PDM RX IIR_HP filter stage 1 is (504 +
         *  LP_I2S_RX_IIR_HP_MULT12_0[2:0])
         */
        uint32_t rx_iir_hp_mult12_0:3;
    };
    uint32_t val;
} lp_i2s_rx_pdm_conf_reg_t;


/** Group: Interrupt registers */
/** Type of int_raw register
 *  I2S interrupt raw register, valid in level.
 */
typedef union {
    struct {
        /** rx_done_int_raw : RO/WTC/SS; bitpos: [0]; default: 0;
         *  The raw interrupt status bit  for the i2s_rx_done_int interrupt
         */
        uint32_t rx_done_int_raw:1;
        /** rx_hung_int_raw : RO/WTC/SS; bitpos: [1]; default: 0;
         *  The raw interrupt status bit  for the i2s_rx_hung_int interrupt
         */
        uint32_t rx_hung_int_raw:1;
        /** rx_fifomem_udf_int_raw : RO/WTC/SS; bitpos: [2]; default: 0;
         *  The raw interrupt status bit  for the i2s_rx_fifomem_udf_int interrupt
         */
        uint32_t rx_fifomem_udf_int_raw:1;
        /** vad_done_int_raw : RO/WTC/SS; bitpos: [3]; default: 0;
         *  The raw interrupt status bit  for the vad_done_int interrupt
         */
        uint32_t vad_done_int_raw:1;
        /** vad_reset_done_int_raw : RO/WTC/SS; bitpos: [4]; default: 0;
         *  The raw interrupt status bit  for the vad_reset_done_int interrupt
         */
        uint32_t vad_reset_done_int_raw:1;
        /** rx_mem_threshold_int_raw : RO/WTC/SS; bitpos: [5]; default: 0;
         *  The raw interrupt status bit  for the rx_mem_threshold_int interrupt
         */
        uint32_t rx_mem_threshold_int_raw:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} lp_i2s_int_raw_reg_t;

/** Type of int_st register
 *  I2S interrupt status register.
 */
typedef union {
    struct {
        /** rx_done_int_st : RO; bitpos: [0]; default: 0;
         *  The masked interrupt status bit  for the i2s_rx_done_int interrupt
         */
        uint32_t rx_done_int_st:1;
        /** rx_hung_int_st : RO; bitpos: [1]; default: 0;
         *  The masked interrupt status bit  for the i2s_rx_hung_int interrupt
         */
        uint32_t rx_hung_int_st:1;
        /** rx_fifomem_udf_int_st : RO; bitpos: [2]; default: 0;
         *  The masked interrupt status bit  for the i2s_rx_fifomem_udf_int interrupt
         */
        uint32_t rx_fifomem_udf_int_st:1;
        /** vad_done_int_st : RO; bitpos: [3]; default: 0;
         *  The masked interrupt status bit  for the vad_done_int interrupt
         */
        uint32_t vad_done_int_st:1;
        /** vad_reset_done_int_st : RO; bitpos: [4]; default: 0;
         *  The masked interrupt status bit  for the vad_reset_done_int interrupt
         */
        uint32_t vad_reset_done_int_st:1;
        /** rx_mem_threshold_int_st : RO; bitpos: [5]; default: 0;
         *  The masked interrupt status bit  for the rx_mem_threshold_int interrupt
         */
        uint32_t rx_mem_threshold_int_st:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} lp_i2s_int_st_reg_t;

/** Type of int_ena register
 *  I2S interrupt enable register.
 */
typedef union {
    struct {
        /** rx_done_int_ena : R/W; bitpos: [0]; default: 0;
         *  The interrupt enable bit  for the i2s_rx_done_int interrupt
         */
        uint32_t rx_done_int_ena:1;
        /** rx_hung_int_ena : R/W; bitpos: [1]; default: 0;
         *  The interrupt enable bit  for the i2s_rx_hung_int interrupt
         */
        uint32_t rx_hung_int_ena:1;
        /** rx_fifomem_udf_int_ena : R/W; bitpos: [2]; default: 0;
         *  The interrupt enable bit  for the i2s_rx_fifomem_udf_int interrupt
         */
        uint32_t rx_fifomem_udf_int_ena:1;
        /** vad_done_int_ena : R/W; bitpos: [3]; default: 0;
         *  The interrupt enable bit  for the vad_done_int interrupt
         */
        uint32_t vad_done_int_ena:1;
        /** vad_reset_done_int_ena : R/W; bitpos: [4]; default: 0;
         *  The interrupt enable bit  for the vad_reset_done_int interrupt
         */
        uint32_t vad_reset_done_int_ena:1;
        /** rx_mem_threshold_int_ena : R/W; bitpos: [5]; default: 0;
         *  The interrupt enable bit  for the rx_mem_threshold_int interrupt
         */
        uint32_t rx_mem_threshold_int_ena:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} lp_i2s_int_ena_reg_t;

/** Type of int_clr register
 *  I2S interrupt clear register.
 */
typedef union {
    struct {
        /** rx_done_int_clr : WT; bitpos: [0]; default: 0;
         *  Set this bit to clear the i2s_rx_done_int interrupt
         */
        uint32_t rx_done_int_clr:1;
        /** rx_hung_int_clr : WT; bitpos: [1]; default: 0;
         *  Set this bit to clear the i2s_rx_hung_int interrupt
         */
        uint32_t rx_hung_int_clr:1;
        /** rx_fifomem_udf_int_clr : WT; bitpos: [2]; default: 0;
         *  Set this bit to clear the i2s_rx_fifomem_udf_int interrupt
         */
        uint32_t rx_fifomem_udf_int_clr:1;
        /** vad_done_int_clr : WT; bitpos: [3]; default: 0;
         *  Set this bit to clear the vad_done_int interrupt
         */
        uint32_t vad_done_int_clr:1;
        /** vad_reset_done_int_clr : WT; bitpos: [4]; default: 0;
         *  Set this bit to clear the vad_reset_done_int interrupt
         */
        uint32_t vad_reset_done_int_clr:1;
        /** rx_mem_threshold_int_clr : WT; bitpos: [5]; default: 0;
         *  Set this bit to clear the rx_mem_threshold_int interrupt
         */
        uint32_t rx_mem_threshold_int_clr:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} lp_i2s_int_clr_reg_t;


/** Group: RX clock and timing registers */
/** Type of rx_timing register
 *  I2S RX timing control register
 */
typedef union {
    struct {
        /** rx_sd_in_dm : R/W; bitpos: [1:0]; default: 0;
         *  The delay mode of I2S Rx SD input signal. 0: bypass. 1: delay by pos edge.  2:
         *  delay by neg edge. 3: not used.
         */
        uint32_t rx_sd_in_dm:2;
        uint32_t reserved_2:14;
        /** rx_ws_out_dm : R/W; bitpos: [17:16]; default: 0;
         *  The delay mode of I2S Rx WS output signal. 0: bypass. 1: delay by pos edge.  2:
         *  delay by neg edge. 3: not used.
         */
        uint32_t rx_ws_out_dm:2;
        uint32_t reserved_18:2;
        /** rx_bck_out_dm : R/W; bitpos: [21:20]; default: 0;
         *  The delay mode of I2S Rx BCK output signal. 0: bypass. 1: delay by pos edge.  2:
         *  delay by neg edge. 3: not used.
         */
        uint32_t rx_bck_out_dm:2;
        uint32_t reserved_22:2;
        /** rx_ws_in_dm : R/W; bitpos: [25:24]; default: 0;
         *  The delay mode of I2S Rx WS input signal. 0: bypass. 1: delay by pos edge.  2:
         *  delay by neg edge. 3: not used.
         */
        uint32_t rx_ws_in_dm:2;
        uint32_t reserved_26:2;
        /** rx_bck_in_dm : R/W; bitpos: [29:28]; default: 0;
         *  The delay mode of I2S Rx BCK input signal. 0: bypass. 1: delay by pos edge.  2:
         *  delay by neg edge. 3: not used.
         */
        uint32_t rx_bck_in_dm:2;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} lp_i2s_rx_timing_reg_t;


/** Group: Control and configuration registers */
/** Type of lc_hung_conf register
 *  I2S HUNG configure register.
 */
typedef union {
    struct {
        /** lc_fifo_timeout : R/W; bitpos: [7:0]; default: 16;
         *  the i2s_tx_hung_int interrupt or the i2s_rx_hung_int interrupt will be triggered
         *  when fifo hung counter is equal to this value
         */
        uint32_t lc_fifo_timeout:8;
        /** lc_fifo_timeout_shift : R/W; bitpos: [10:8]; default: 0;
         *  The bits are used to scale tick counter threshold. The tick counter is reset when
         *  counter value >= 88000/2^i2s_lc_fifo_timeout_shift
         */
        uint32_t lc_fifo_timeout_shift:3;
        /** lc_fifo_timeout_ena : R/W; bitpos: [11]; default: 1;
         *  The enable bit for FIFO timeout
         */
        uint32_t lc_fifo_timeout_ena:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} lp_i2s_lc_hung_conf_reg_t;

/** Type of conf_sigle_data register
 *  I2S signal data register
 */
typedef union {
    struct {
        /** single_data : R/W; bitpos: [31:0]; default: 0;
         *  The configured constant channel data to be sent out.
         */
        uint32_t single_data:32;
    };
    uint32_t val;
} lp_i2s_conf_sigle_data_reg_t;


