espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/lp_i2s_struct.h
/** Group: ECO registers */
/** Type of eco_low register
 *  I2S ECO register
 */
typedef union {
    struct {
        /** rdn_eco_low : R/W; bitpos: [31:0]; default: 0;
         *  logic low eco registers
         */
        uint32_t rdn_eco_low:32;
    };
    uint32_t val;
} lp_i2s_eco_low_reg_t;

/** Type of eco_high register
 *  I2S ECO register
 */
typedef union {
    struct {
        /** rdn_eco_high : R/W; bitpos: [31:0]; default: 4294967295;
         *  logic high eco registers
         */
        uint32_t rdn_eco_high:32;
    };
    uint32_t val;
} lp_i2s_eco_high_reg_t;

/** Type of eco_conf register
 *  I2S ECO register
 */
typedef union {
    struct {
        /** rdn_ena : R/W; bitpos: [0]; default: 0;
         *  enable rdn counter bit
         */
        uint32_t rdn_ena:1;
        /** rdn_result : RO; bitpos: [1]; default: 0;
         *  rdn result
         */
        uint32_t rdn_result:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} lp_i2s_eco_conf_reg_t;


/** Group: Clock registers */
/** Type of clk_gate register
 *  Clock gate register
 */
typedef union {
    struct {
        /** clk_en : R/W; bitpos: [0]; default: 0;
         *  set this bit to enable clock gate
         */
        uint32_t clk_en:1;
        /** vad_cg_force_on : R/W; bitpos: [1]; default: 1;
         *  VAD clock gate force on register
         */
        uint32_t vad_cg_force_on:1;
        /** rx_mem_cg_force_on : R/W; bitpos: [2]; default: 0;
         *  I2S rx mem clock gate force on register
         */
        uint32_t rx_mem_cg_force_on:1;
        /** rx_reg_cg_force_on : R/W; bitpos: [3]; default: 1;
         *  I2S rx reg clock gate force on register
         */
        uint32_t rx_reg_cg_force_on:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} lp_i2s_clk_gate_reg_t;


/** Group: Version register */
/** Type of date register
 *  Version control register
 */
typedef union {
    struct {
        /** date : R/W; bitpos: [27:0]; default: 36720704;
         *  I2S version control register
         */
        uint32_t date:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} lp_i2s_date_reg_t;


typedef struct lp_i2s_dev_t {
    volatile lp_i2s_vad_conf_reg_t vad_conf;
    volatile lp_i2s_vad_result_reg_t vad_result;
    volatile lp_i2s_rx_mem_conf_reg_t rx_mem_conf;
    volatile lp_i2s_int_raw_reg_t int_raw;
    volatile lp_i2s_int_st_reg_t int_st;
    volatile lp_i2s_int_ena_reg_t int_ena;
    volatile lp_i2s_int_clr_reg_t int_clr;
    uint32_t reserved_01c;
    volatile lp_i2s_rx_conf_reg_t rx_conf;
    uint32_t reserved_024;
    volatile lp_i2s_rx_conf1_reg_t rx_conf1;
    uint32_t reserved_02c[9];
    volatile lp_i2s_rx_tdm_ctrl_reg_t rx_tdm_ctrl;
    uint32_t reserved_054;
    volatile lp_i2s_rx_timing_reg_t rx_timing;
    uint32_t reserved_05c;
    volatile lp_i2s_lc_hung_conf_reg_t lc_hung_conf;
    volatile lp_i2s_rxeof_num_reg_t rxeof_num;
    volatile lp_i2s_conf_sigle_data_reg_t conf_sigle_data;
    uint32_t reserved_06c;
    volatile lp_i2s_rx_pdm_conf_reg_t rx_pdm_conf;
    volatile lp_i2s_eco_low_reg_t eco_low;
    volatile lp_i2s_eco_high_reg_t eco_high;
    volatile lp_i2s_eco_conf_reg_t eco_conf;
    volatile lp_i2s_vad_param0_reg_t vad_param0;
    volatile lp_i2s_vad_param1_reg_t vad_param1;
    volatile lp_i2s_vad_param2_reg_t vad_param2;
    volatile lp_i2s_vad_param3_reg_t vad_param3;
    volatile lp_i2s_vad_param4_reg_t vad_param4;
    volatile lp_i2s_vad_param5_reg_t vad_param5;
    volatile lp_i2s_vad_param6_reg_t vad_param6;
    volatile lp_i2s_vad_param7_reg_t vad_param7;
    volatile lp_i2s_vad_param8_reg_t vad_param8;
    uint32_t reserved_0a4[3];
    volatile lp_i2s_vad_ob0_reg_t vad_ob0;
    volatile lp_i2s_vad_ob1_reg_t vad_ob1;
    volatile lp_i2s_vad_ob2_reg_t vad_ob2;
    volatile lp_i2s_vad_ob3_reg_t vad_ob3;
    volatile lp_i2s_vad_ob4_reg_t vad_ob4;
    volatile lp_i2s_vad_ob5_reg_t vad_ob5;
    volatile lp_i2s_vad_ob6_reg_t vad_ob6;
    volatile lp_i2s_vad_ob7_reg_t vad_ob7;
    volatile lp_i2s_vad_ob8_reg_t vad_ob8;
    uint32_t reserved_0d4[9];
    volatile lp_i2s_clk_gate_reg_t clk_gate;
    volatile lp_i2s_date_reg_t date;
} lp_i2s_dev_t;

extern lp_i2s_dev_t LP_I2S;

#ifndef __cplusplus
_Static_assert(sizeof(lp_i2s_dev_t) == 0x100, "Invalid size of lp_i2s_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
